Revit 2017 API
Space Properties
The Space type exposes the following members.
Properties
Name | Description
ActualExhaustAirflow
Get the Actual Exhaust Airflow of the Space.
ActualHVACLoad
Get or set the Actual HVAC Load of the Space.
ActualLightingLoad
Get the Actual Lighting Load of the Space.
ActualOtherLoad
Get or set the Actual Other Load of the Space.
ActualPowerLoad
Get the Actual Power Load of the Space.
ActualReturnAirflow
Get or set the Actual Return Airflow of the Space.
ActualSupplyAirflow
Get or set the Actual Supply Airflow of the Space.
Area
The area.
 (Inherited from SpatialElement.)
AreaperPerson
Get the Area per Person of the Space.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
AverageEstimatedIllumination
Get the Average Estimated Illumination of the Space.
BaseHeatLoadOn
The heat load-on.
BaseOffset
Get or Set the Base Offset of the Space.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CalculatedCoolingLoad
Get the Calculated Cooling Load of the Space.
CalculatedHeatingLoad
Get the Calculated Heating Load of the Space.
CalculatedSupplyAirflow
Get or set the Calculated Supply Airflow of the Space.
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CeilingReflectance
Get or set the Ceiling Reflectance of the Space.
ClosedShell
Return the closedShell of the space.
ConditionType
Get or set the Condition type of the Space.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignCoolingLoad
Get the Design Cooling Load of the Space.
DesignExhaustAirflow
Get or set the Specified Exhaust Airflow of the Space.
DesignHeatingLoad
Get the Design Heating Load of the Space.
DesignHVACLoadperArea
Get or set the Design HVAC Load per Area of the Space.
DesignLightingLoad
Get or set the Design Lighting Load of the Space.
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
DesignOtherLoadperArea
Get or set the Design Other Load per Area of the Space.
DesignPowerLoad
Get or set the Design Power Load of the Space.
DesignReturnAirflow
Get or set the Specified Return Airflow of the Space.
DesignSupplyAirflow
Get or set the Specified Supply Airflow of the Space.
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
FloorReflectance
Get or set the Floor Reflectance of the Space.
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LatentHeatGainperPerson
Get or set the Latent Heat Gain per Person of the Space.
Level
Gets the level of the room.
 (Inherited from SpatialElement.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
LightingCalculationWorkplane
Get the Lighting Calculation Workplane of the Space.
LightingLoadUnit
Get or Set the Lighting Load Unit of the Space.
LimitOffset
Get or Set the Limit Offset of the Space.
Location
The location of the element.
 (Inherited from SpatialElement.)
Name
A human readable name for the Element.
 (Inherited from SpatialElement.)
Number
The number.
 (Inherited from SpatialElement.)
NumberofPeople
Get the Number of People of the Space.
OccupancyUnit
Get the Occupancy Unit of the Space.
Occupiable
Reports whether this zone is Occupiable or not.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Perimeter
The perimeter.
 (Inherited from SpatialElement.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Plenum
Reports whether this zone is Plenum or not.
PowerLoadUnit
Get or Set the Power Load Unit of the Space.
ReturnAirflow
Get or set the Return type of Supply Airflow of the Space.
Room
Return the Room of the space.
SensibleHeatGainperPerson
Get the Sensible Heat Gain per Person of the Space.
SpaceCavityRatio
Get the Space Cavity Ratio of the Space.
SpaceConstruction
Get the Space Construction of the Space.
SpaceType
Get or set the Space type of the Space.
UnboundedHeight
Get the Unbounded Height of the Space.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UpperLimit
Get or Set the Upper Limit of the Space.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Volume
Get the Volume of the Space.
WallReflectance
Get or set the Wall Reflectance of the Space.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
Zone
Reports this space belong to which Zone.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace